Autodesk.Revit.DB.TessellatedShapeBuilder.GetBuildResult
Get the built geometry, build status and other data stored in TessellatedShapeBuilderResult. Clears the stored data.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.CreateMeshByExtrusion(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.ElementId)
Builds a mesh by extruding curve loop(s) along extrusion distance.
Remarks:
This function supports creation of a mesh given a collection
of continuous curve loops, which are processed independently
from each other. Loops with gaps or with curves with
wrong flips will be split before processing.
profileLoops:
The profile loops to be extruded. The loops will not be modified.
extrusionDirection:
Direction of extrusion. The length of this vector is ignored.
extrusionDistance:
The positive distance by which the loops are extruded in the
direction of the input extrusionDir.
materialId:
Material which should be used by a constructed mesh.
Returns:
Returns a mesh, which was constructed, and some additional
information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input value cannot be used as thickness for an extrusion,
or blend, or wall layer, or similar geometric construct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
extrusionDirection has zero length.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.Build
Builds the designated geometrical objects from the stored face sets. Stores the result in this TessellatedShapeBuilder object.
Remarks:
The behavior of this function is affected by Target, Fallback and GStyleId properties of this TessellatedShapeBuilder object.
Currently only "Solid/Abort", "AnyGeometry/Mesh" and
"Mesh/Salvage" target/fallback combinations are supported.
Note that this function does not erase the face sets stored in the builder.
If the same builder is used to construct geometrical objects for different
collections of face sets, (Autodesk.Revit.DB.TessellatedShapeBuilder.Clear) should be called
while switching from one collection to another.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if data in the stored face sets are so inconsistent, that
they cannot be used in their entirety, or if an attempt is made to create unacceptable geometry
with too many facets.
Since:
2017

Autodesk.Revit.DB.TessellatedShapeBuilder.AreTargetAndFallbackCompatible(Autodesk.Revit.DB.TessellatedShapeBuilderTarget,Autodesk.Revit.DB.TessellatedShapeBuilderFallback)
Checks whether this combination of fallback and target parameters
can be used as a valid combination of inputs.
target:
What kind of geometrical objects should be built.
fallback:
What should be done if a geometrical object described by 'target'
parameter cannot be built using all data from all stored face sets.
Returns:
True if the combination of fallback and target are a valid combination, false
otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.AddFace(Autodesk.Revit.DB.TessellatedFace)
Adds a face to the currently open connected face set.
face:
Face to add. The 'face' parameter can be added only once, as its
boundary loops will be cleared while adding and 'face' will become unusable.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The 'face' does not have enough loops and/or vertices to be valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A face set is closed and faces cannot be added to it.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.DoesFaceHaveEnoughLoopsAndVertices(Autodesk.Revit.DB.TessellatedFace)
Checks whether 'face' has enough loops and vertcies to be valid.
Remarks:
Face 'face' is not modified.
face:
The face to check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.Clear
Erases all face set and clears the logs, if any.
Remarks:
This function can be safely called upon builder without an open face set.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.CancelConnectedFaceSet
Cancels the current face set - i.e., all data from it will be lost
and the builder will have no open connected face set anymore.
Remarks:
This function can be safely called upon builder without an open face set.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.CloseConnectedFaceSet
Closes the currently open connected face set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A face set is empty and cannot be closed until some faces are added.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.OpenConnectedFaceSet(System.Boolean)
Opens a new connected face set.
isSolid:
Whether the face set, which is being open, should be build as a solid or as a void.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A face set is open and a geometry cannot be build until it is closed.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.NumberOfCompletedFaceSets
Number of completed face sets.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.OwnerInfo
String used for logging, if any. Usually describes the element or object, which
either defined or will own the geoemtrical objects to be built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.LogInteger
Integer value used for logging, if it is performed. Usually
the number of the face set(s) in the IFC file, from which they
are imported. Any value is acceptable.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.LogString
String used for logging, if any. Usually the name of the file from which
face sets were imported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.GraphicsStyleId
Optional - if set, the built geometry will use that graphics style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.TessellatedShapeBuilder.Fallback
Defines acceptable fallback if the desired type of geometry can't be built.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.TessellatedShapeBuilder.Target
Requests the type of geometry to be built.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.TessellatedShapeBuilder.IsFaceSetOpen
Flag whether the current set of connected faces is open and
additional tessellation faces can be added to it.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.#ctor
Constructs a new instance of a TessellatedShapeBuilder.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder
A class that permits structured building of geometry or
a mesh from a collection of connected faces.
Contains all closed face sets and custom precisions.
Remarks:
Creates a geometry populated with faces defined by TessellatedFace objects
stored in the input connected face sets.
The faces defined by each connected face set may form an open shell or
the boundary of a solid 3D region.
All faces are planar and have polyline boundaries, defined
as sequences of 3d coordinates.
Faces are added to the builder as a part of connected face sets,
representing faces which share edges.
Order of faces in the sets is irrelevant. Faces can only
be added to the builder when a face set has been opened and is available
to take in faces (use Autodesk.Revit.DB.TessellatedShapeBuilder.OpenConnectedFaceSet(System.Boolean) to open a new face set).
Before attempting to build Revit geometry from the builder
the current face set should be closed
(Autodesk.Revit.DB.TessellatedShapeBuilder.CloseConnectedFaceSet).
The builder allows for the possibility of multiple face sets.
The builder will try to create a geometry valid in Revit despite
inconsistencies or omissions in the input data.
For each connected face set, it will check the face orientations and
change them wherever needed so that the orientations of the faces
in that set are consistent.  If a connected face set is closed, it will check if the face normals
point outward. If not, it will reverse the orientations of all faces.
That means, each closed connected face set will represent a solid.
Limitations in the current implementation:
It does not support the definition of a "void", even if the user had
set the orientations of the faces to define a "void".  If there is more than one connected face set, it does not check if they
intersect or overlap each other.
Since:
2015